#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_resource_group.logging_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.app_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-logic-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-logic-nsg001][0m
[0m[1mazapi_resource.subnet_logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/LogicAppSubnet][0m
[0m[1mazurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001][0m
[0m[1mazurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001][0m
[0m[1mazapi_resource.subnet_services: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogic-dev-vault001-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001|logAnalytics][0m
[0m[1mazapi_resource.storage_file_share: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/fileServices/default/shares/logicapp][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-blob-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-queue-pe][0m
[0m[1mazurerm_storage_management_policy.storage_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/managementPolicies/default][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_file: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-file-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_table: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-table-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_logic_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_logic_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azurerm_logic_app_standard.logic_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_logic_app_standard" "logic_app" {
      [32m+[0m[0m app_service_plan_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001"
      [32m+[0m[0m app_settings                   = {
          [32m+[0m[0m "FUNCTIONS_WORKER_RUNTIME"     = "node"
          [32m+[0m[0m "WEBSITE_CONTENTOVERVNET"      = "1"
          [32m+[0m[0m "WEBSITE_NODE_DEFAULT_VERSION" = "~18"
        }
      [32m+[0m[0m bundle_version                 = "[1.*, 2.0.0)"
      [32m+[0m[0m client_affinity_enabled        = false
      [32m+[0m[0m client_certificate_mode        = "Required"
      [32m+[0m[0m custom_domain_verification_id  = (known after apply)
      [32m+[0m[0m default_hostname               = (known after apply)
      [32m+[0m[0m enabled                        = true
      [32m+[0m[0m https_only                     = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m kind                           = (known after apply)
      [32m+[0m[0m location                       = "northeurope"
      [32m+[0m[0m name                           = "mylogic-dev-la001"
      [32m+[0m[0m outbound_ip_addresses          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses = (known after apply)
      [32m+[0m[0m resource_group_name            = "mylogic-dev-app-rg"
      [32m+[0m[0m site_credential                = (known after apply)
      [32m+[0m[0m storage_account_access_key     = (sensitive value)
      [32m+[0m[0m storage_account_name           = "mylogicdevstg001"
      [32m+[0m[0m storage_account_share_name     = "logicapp"
      [32m+[0m[0m use_extension_bundle           = true
      [32m+[0m[0m version                        = "~4"
      [32m+[0m[0m virtual_network_subnet_id      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/LogicAppSubnet"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                        = false
          [32m+[0m[0m app_scale_limit                  = 0
          [32m+[0m[0m dotnet_framework_version         = "v6.0"
          [32m+[0m[0m elastic_instance_minimum         = 1
          [32m+[0m[0m ftps_state                       = "Disabled"
          [32m+[0m[0m http2_enabled                    = true
          [32m+[0m[0m ip_restriction                   = []
          [32m+[0m[0m linux_fx_version                 = (known after apply)
          [32m+[0m[0m min_tls_version                  = "1.2"
          [32m+[0m[0m pre_warmed_instance_count        = 1
          [32m+[0m[0m runtime_scale_monitoring_enabled = true
          [32m+[0m[0m scm_ip_restriction               = []
          [32m+[0m[0m scm_min_tls_version              = "1.2"
          [32m+[0m[0m scm_type                         = "None"
          [32m+[0m[0m scm_use_main_ip_restriction      = false
          [32m+[0m[0m use_32_bit_worker_process        = false
          [32m+[0m[0m vnet_route_all_enabled           = true
          [32m+[0m[0m websockets_enabled               = false
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_logic_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_private_endpoint.logic_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "logic_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mylogic-dev-la001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mylogic-dev-la001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mylogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mylogic-dev-la001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mylogic-dev-la001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_storage" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_service_plan.service_plan[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_service_plan" "service_plan" {
        id                           = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001"
        name                         = "mylogic-dev-asp001"
        tags                         = {}
      [33m~[0m[0m worker_count                 = 1 [33m->[0m[0m 3
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 5 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>